/******* QDMOBJA.CPP ***********************************************
*                                                                  *
*              Copyright (c) PANORAMA Group 1991-2018              *
*                      All Rights Reserved                         *
*                                                                  *
********************************************************************
*                                                                  *
*                       FOR Qt-DESIGNER                            *
*                                                                  *
********************************************************************
*                                                                  *
*     ОПИСАНИЕ БАЗОВОГО КЛАССА ОБЪЕКТА ЭЛЕКТРОННОЙ КАРТЫ           *
*                                                                  *
*******************************************************************/

#include "qdmobja.h"
#include "mapapi.h"

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ++ БАЗОВЫЙ КЛАСС ОБЪЕКТА ЭЛЕКТРОННОЙ КАРТЫ                  +++++
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

QDMapObjAcces::QDMapObjAcces(QWidget * parent, const char * name)
             :QDMapComponent(parent, name)
{
  VarObjHandle = 0;
  hide();
}

QDMapObjAcces::~QDMapObjAcces()
{
  if (VarObjHandle != 0) mapFreeObject(VarObjHandle);
  VarObjHandle = 0;
}

//-----------------------------------------------------------
// Возвращает идентификатор объекта
//-----------------------------------------------------------
HOBJ QDMapObjAcces::GetObjHandle()
{
 return VarObjHandle;
}

