/******* QDMVIEWA.CPP **********************************************
*                                                                  *
*              Copyright (c) PANORAMA Group 1991-2018              *
*                      All Rights Reserved                         *
*                                                                  *
********************************************************************
*                                                                  *
*                      FOR Qt-DESIGNER                             *
*                                                                  *
********************************************************************
*                                                                  *
*       ОПИСАНИЕ БАЗОВОГО КЛАССА ДОСТУПА К ОБЪЕКТУ                 *
*                     "ЭЛЕКТРОННАЯ КАРТА"                          *
*                                                                  *
*******************************************************************/

#include "qdmviewa.h"

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ++++ БАЗОВЫЙ КЛАСС "ИНТЕРФЕЙС УПРАВЛЕНИЯ ЭЛЕКТРОННОЙ КАРТОЙ" ++++
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//-------------------------------------------
//      Конструктор
//-------------------------------------------
QDMapViewAcces::QDMapViewAcces(QWidget *parent)
               : QWidget(parent)
{
  VarMapHandle = 0;
  MainCodec = QTextCodec::codecForName("KOI8-R");
  MainCodecCp1251 = QTextCodec::codecForName("CP1251");
  memset(ClassName, 0, sizeof(ClassName));
}

//-------------------------------------------
// Получить идентификатор карты
//-------------------------------------------
HMAP QDMapViewAcces::GetMapHandle()
{
  return VarMapHandle;
}

//-------------------------------------------
// Получить объект доступа к карте
//-------------------------------------------
QDMapViewAcces* QDMapViewAcces::GetMapViewAcces()
{
  return this;
}


//-------------------------------------------
// Получить название класса
//-------------------------------------------
const char * QDMapViewAcces::GetClassName()
{
  return ClassName;
}

//-------------------------------------------
// Установить название класса
//-------------------------------------------
void QDMapViewAcces::SetClassName(const char *name)
{
  if (name && (name[0] != 0))
    strcpy(ClassName, name);
  else
    memset(ClassName, 0, sizeof(ClassName));
}

//-------------------------------------------
// Запросить количество открытых сайтов в карте
//-------------------------------------------
long QDMapViewAcces::GetSiteCount()
{
  if (GetMapHandle() == 0)
    return 0;

  return mapGetSiteCount( GetMapHandle() );
}
